// 1. Понятие сложной системы. Структура сложных систем и примеры.
Сложная система — система, состоящая из множества взаимодействующих составляющих (подсистем), 
вследствие чего она приобретает новые свойства, которые отсутствуют на подсистемном уровне 
и не могут быть сведены к свойствам подсистемного уровня.

Функциональные составляющие, приведенные в определении структуры системы, носят названия: подсистемы и элементы.

Элемент (в формализованной схеме системы) – это объект(часть системы), не подлежащий(при данном рассмотрении системы) 
дальнейшему разбиению на части. Внутренняя структура элемента при этом не является предметом изучения. Должны быть 
известны только те свойства элемента, которые определяют его взаимодействие с другими элементами системы и оказывают 
влияние на свойства системы в целом.

Подсистема – совокупность элементов системы вместе со связями между ними. Подсистемы могут быть разных рангов (уровней). 
Выделение подсистем является важным этапом при построении формального описания сложной системы. Оно позволяет иногда 
упростить исследование сложной системы, т.к. уменьшается число связей в системе и, следовательно, громоздкость исследований. 
С другой стороны, переход от системы к подсистемам ведет к новому множеству связей. Подсистемы сложной системы сами могут 
быть сложными системами. Поэтому с формальной точки зрения сущность подсистемы двойственна: с одной стороны она является 
системой, состоящей из некоторого числа элементов, а с другой – представляет собой элемент сложной системы.